app/views/kennels/_searched_kennel_id.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
              <td class="kennel_reservation_td"><%= @reservation[:id] %></td>
              <% user = User.find(@reservation[:user_id]) %>