app/views/kennels/search_reservations.erb

				<% JSON.parse(res[:pet_ids]).each do |p_id| %>
					<% if !Pet.find_by(id: p_id).nil? %>
---
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT 1  [["id", 1]]