app/controllers/customers_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "customer_emergency_contacts".* FROM "customer_emergency_contacts" WHERE "customer_emergency_contacts"."user_id" = $1 LIMIT 1  [["user_id", 1]]
SELECT  "customer_vet_infos".* FROM "customer_vet_infos" WHERE "customer_vet_infos"."user_id" = $1 LIMIT 1  [["user_id", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = $1 AND "reservations"."completed" = $2  [["user_id", 1], ["completed", "false"]]
---
  def customer_dashboard
    @customer = User.find(current_user.id)
    @customer_emergency_contact = CustomerEmergencyContact.find_by(user_id: current_user.id)
    @customer_vet_info = CustomerVetInfo.find_by(user_id: current_user.id)
    @upcoming_reservations = Reservation.where(user_id: current_user.id, completed: "false")