app/controllers/home_controller.rb

  def index
    if !current_user.nil? && current_user.kennel_or_customer == "kennel"
       redirect_to kennel_dashboard_path
    elsif !current_user.nil? && current_user.kennel_or_customer == "customer"
       redirect_to customer_dashboard_path
    elsif !current_user.nil? && current_user.kennel_or_customer == "admin"
       redirect_to pawbookings_admins_path
    else
       root_path
    end

    @kennel_ratings = KennelRating.where(rating: 5).last(3).reverse
---
SELECT  "kennel_ratings".* FROM "kennel_ratings" WHERE "kennel_ratings"."rating" = $1  ORDER BY "kennel_ratings"."id" DESC LIMIT 3  [["rating", 5]]