app/controllers/hours_of_operations_controller.rb

  def update
    puts '_______________'
    puts params
    hours_of_operation = HoursOfOperation.find(params[:hours_of_operation][:id])
    hours_of_operation_1 = HoursOfOperation.find(params[:hours_of_operation_1][:id])

    hours_of_operation.update(monday_open: params[:hours_of_operation][:monday_open], monday_close: params[:hours_of_operation][:monday_close], tuesday_open: params[:hours_of_operation][:tuesday_open], tuesday_close: params[:hours_of_operation][:tuesday_close], wednesday_open: params[:hours_of_operation][:wednesday_open], wednesday_close: params[:hours_of_operation][:wednesday_close], thursday_open: params[:hours_of_operation][:thursday_open], thursday_close: params[:hours_of_operation][:thursday_close], friday_open: params[:hours_of_operation][:friday_open], friday_close: params[:hours_of_operation][:friday_close], saturday_open: params[:hours_of_operation][:saturday_open], saturday_close: params[:hours_of_operation][:saturday_close], sunday_open: params[:hours_of_operation][:sunday_open], sunday_close: params[:hours_of_operation][:sunday_close])
---
SELECT  "hours_of_operations".* FROM "hours_of_operations" WHERE "hours_of_operations"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "hours_of_operations" SET "monday_open" = $1, "monday_close" = $2, "updated_at" = $3 WHERE "hours_of_operations"."id" = $4  [["monday_open", "5:30 am"], ["monday_close", "12:30 pm"], ["updated_at", "2019-06-17 10:44:52.898463"], ["id", 1]]