app/controllers/kennels_controller.rb

SELECT  "kennels".* FROM "kennels" WHERE "kennels"."user_id" = $1  ORDER BY "kennels"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "runs".* FROM "runs" WHERE "runs"."kennel_id" = $1  [["kennel_id", 1]]
SELECT "amenities".* FROM "amenities" WHERE "amenities"."kennel_id" = $1  [["kennel_id", 1]]
SELECT "holidays".* FROM "holidays" WHERE "holidays"."kennel_id" = $1  [["kennel_id", 1]]
SELECT "policies".* FROM "policies" WHERE "policies"."kennel_id" = $1  [["kennel_id", 1]]
SELECT "breed_restrictions".* FROM "breed_restrictions" WHERE "breed_restrictions"."kennel_id" = $1  [["kennel_id", 1]]
SELECT "photos".* FROM "photos" WHERE "photos"."kennel_id" = $1  [["kennel_id", 1]]
SELECT  "hours_of_operations".* FROM "hours_of_operations" WHERE "hours_of_operations"."kennel_id" = $1  ORDER BY "hours_of_operations"."id" DESC LIMIT 1  [["kennel_id", 1]]
INSERT INTO "hours_of_operations" ("monday_open", "monday_close", "tuesday_open", "tuesday_close", "wednesday_open", "wednesday_close", "thursday_open", "thursday_close", "friday_open", "friday_close", "saturday_open", "saturday_close", "sunday_open", "sunday_close", "kennel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
SELECT COUNT(*) FROM "hours_of_operations" WHERE "hours_of_operations"."kennel_id" = $1  [["kennel_id", 1]]
---
  def index
    @tab = params[:tab] || 'kennel'
    @kennel_create = params[:kennel_create]

    if !Kennel.where(user_id: current_user.id).first.nil?
      @kennel = Kennel.where(user_id: current_user.id).first
      @runs = Run.where(kennel_id: @kennel.id).to_a
      @amenities = Amenity.where(kennel_id: @kennel.id).to_a
      @holidays = Holiday.where(kennel_id: @kennel.id)
      @policies = Policy.where(kennel_id: @kennel.id)
      @breed_restrictions = BreedRestriction.where(kennel_id: @kennel.id)
      @photos = Photo.where(kennel_id: @kennel.id)
      @hours_of_operation = HoursOfOperation.where(kennel_id: @kennel.id).first
      create_new = (HoursOfOperation.where(kennel_id: @kennel.id).count == 2) ? HoursOfOperation.where(kennel_id: @kennel.id).last : HoursOfOperationsController.new.create(@kennel[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "kennels".* FROM "kennels" WHERE "kennels"."user_id" = $1 LIMIT 1  [["user_id", 1]]
INSERT INTO "kennels" ("name", "cats_or_dogs", "address", "city", "state", "zip", "email", "mission_statement", "taken_ownership", "phone", "slug", "latitude", "longitude", "sales_tax", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16) RETURNING "id"
UPDATE "kennels" SET "userID" = $1, "kennelID" = $2, "updated_at" = $3 WHERE "kennels"."id" = $4  [["userID", 1], ["kennelID", 1], ["updated_at", "2019-06-17 10:43:47.439115"], ["id", 1]]
UPDATE "users" SET "completed_registration" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["completed_registration", "true"], ["updated_at", "2019-06-17 10:43:47.497901"], ["id", 1]]
INSERT INTO "hours_of_operations" ("monday_open", "monday_close", "tuesday_open", "tuesday_close", "wednesday_open", "wednesday_close", "thursday_open", "thursday_close", "friday_open", "friday_close", "saturday_open", "saturday_close", "sunday_open", "sunday_close", "kennel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    user = User.where(id: current_user.id).first

    tax = params[:kennel][:sales_tax] == '' ? '0' : params[:kennel][:sales_tax]
    kennel = Kennel.new(kennel_params.merge(phone: params[:kennel][:phone].scan(/\d/).join,
                                            mission_statement: kennel_params[:mission_statement],
                                            sales_tax: tax, user_id: user.id))


    if kennel.valid? && kennel.save && user.kennel == kennel
      flash[:notice] = "Your Kennel was created successfully!"
      kennel.userID = user[:id]
      kennel.kennelID = kennel[:id]
      kennel.save
      HoursOfOperationsController.new.create(kennel[:id])

SELECT  "kennels".* FROM "kennels" WHERE "kennels"."id" = $1 LIMIT 1  [["id", 8]]
---
  def edit
    @kennel = Kennel.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "kennels".* FROM "kennels" WHERE "kennels"."user_id" = $1  ORDER BY "kennels"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."check_in_date" = $1 AND "reservations"."kennel_id" = $2  [["check_in_date", "2019-06-03"], ["kennel_id", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."check_out_date" = $1 AND "reservations"."kennel_id" = $2  [["check_out_date", "2019-06-03"], ["kennel_id", 1]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."kennel_id" = $1  [["kennel_id", 1]]
SELECT  "hours_of_operations".* FROM "hours_of_operations" WHERE "hours_of_operations"."kennel_id" = $1  ORDER BY "hours_of_operations"."id" ASC LIMIT 1  [["kennel_id", 1]]
SELECT  "runs".* FROM "runs" WHERE "runs"."kennel_id" = $1  ORDER BY "runs"."id" ASC LIMIT 1  [["kennel_id", 1]]
---
  def kennel_dashboard
    if !current_user.nil?
      @user = User.find(current_user.id)
      @kennel = Kennel.where(user_id: current_user.id).first
      if !@kennel.nil?
        @check_in_today = Reservation.where(check_in_date: Time.now.strftime("%a, %d %B %Y"), kennel_id: @kennel.id)
        @check_out_today = Reservation.where(check_out_date: Time.now.strftime("%a, %d %B %Y"), kennel_id: @kennel.id)
        @reservation_search_results = filter_reservation_search if !params[:search_by].blank?
        reservations = Reservation.where(kennel_id: @kennel[:id])
        @reservations = reservations if !reservations.blank?
        @hours_of_operation = HoursOfOperation.where(kennel_id: @kennel[:id]).first
        check_if_hours_of_operation_exist
        @kennel_run = Run.where(kennel_id: @kennel[:id]).first || nil

SELECT  "kennels".* FROM "kennels" WHERE "kennels"."user_id" = $1  ORDER BY "kennels"."id" ASC LIMIT 1  [["user_id", 1]]
---
  def search_reservations
    puts params
    @kennel = Kennel.where(user_id: current_user.id).first

SELECT  "reservations".* FROM "reservations" WHERE "reservations"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT 1  [["id", 1]]
---
  def kennel_searched_reservation
    @reservation = Reservation.find(params[:id])
    @pets = []
    @pet_ids = []
    JSON.parse(@reservation[:pet_ids]).each do |p_id|
      if !Pet.find_by(id: p_id).nil?