app/controllers/pets_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = $1  [["user_id", 1]]
---
  def index
    @pets = Pet.where(user_id: current_user.id)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "pets" ("user_id", "name", "cat_or_dog", "breed", "weight", "vaccinations", "spay_or_neutered", "special_instructions", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def create
    params[:pet][:breed] = "cat" if params[:pet][:cat_or_dog] == "cat"
    pet = Pet.new(pet_params)
    user = User.find(current_user.id)
    if pet.valid? && user.pets.create!(user_id: user.id, name: pet.name, cat_or_dog: pet.cat_or_dog, breed: pet.breed, weight: pet.weight, vaccinations: pet.vaccinations, spay_or_neutered: pet.spay_or_neutered, vaccination_record: pet.vaccination_record, avatar: pet.avatar, special_instructions: pet.special_instructions, age: pet.age)