app/controllers/reservations_controller.rb

  def create
    user = User.find_by_email(params[:customer_email])
    run_ids = []
    pet_ids = []
    amenity_ids = []

    if(params[:customer_first_name] == '' || params[:customer_last_name] == '' || params[:customer_email] == '' || params[:customer_phone] == '' || params[:month_in] == '' || params[:month_out] == '' || params[:day_in] == '' || params[:date_out] == '' || params[:year_in] == '' || params[:year_out] == '')
      return redirect_to kennel_dashboard_path
    end

    if (!Date.valid_date? params[:year_in].to_i, params[:month_in].to_i, params[:day_in].to_i) || (!Date.valid_date? params[:year_out].to_i, params[:month_out].to_i, params[:day_out].to_i)
      return redirect_to kennel_dashboard_path
    end

    check_in_date_params = params[:month_in] + '/' +params[:day_in] +'/' + params[:year_in]
    check_out_date_params = params[:month_out] + '/' +params[:day_out] +'/' + params[:year_out]
    dates = [Date.strptime(check_in_date_params,"%m/%d/%Y"), Date.strptime(check_out_date_params,"%m/%d/%Y")]

    @kennel = current_user.kennel
    run_ids = params["room-units"] if params["room-units"].present?
    if params["pet_name"].present? && params["pet_type"]
      npet = user.pets.create!(name: params["pet_name"], cat_or_dog: params["pet_type"], weight: "1", vaccinations: "false", spay_or_neutered: "neutered")
      pet_ids = [npet.id.to_s]
    elsif params["pets"].present?
      pet_ids = params["pets"]
    end

    reserved_dates = @kennel.reservations.where(completed: "false").pluck(:check_in_date, :check_out_date, :run_ids)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "hello@gmail.com"]]
SELECT "reservations"."check_in_date", "reservations"."check_out_date", "reservations"."run_ids" FROM "reservations" WHERE "reservations"."kennel_id" = $1 AND "reservations"."completed" = $2  [["kennel_id", 1], ["completed", "false"]]

    reserved_dates.each do |rdate|
      rids = rdate[2].tr('[]', '').split(',').map(&:to_i)
      ru = params["room-units"].map(&:to_i).flatten.try(:first)
      actual_run = Run.find_by_id(ru)
---
SELECT  "runs".* FROM "runs" WHERE "runs"."id" = $1 LIMIT 1  [["id", 1]]

  days = 1 if days == 0
  total_price_without_tax = 0
  if run_ids.present?
    run_prices = @kennel.runs.where(id: run_ids.map(&:to_i)).pluck(:price)
    run_prices.each do |pr|
---
SELECT "runs"."price" FROM "runs" WHERE "runs"."kennel_id" = $1 AND "runs"."id" = 1  [["kennel_id", 1]]
SELECT "runs".* FROM "runs" WHERE "runs"."kennel_id" = $1 AND "runs"."id" = 1  [["kennel_id", 1]]

      reservation.kennelID = reservation[:kennel_id]
      reservation.userID = reservation[:user_id]
      reservation.reservationID = reservation[:id]
      reservation.save!
---
INSERT INTO "reservations" ("user_id", "check_in_date", "check_out_date", "room_details", "amenity_details", "total_price_without_tax", "tax_percentage", "tax_total_price", "total_price", "payment_first_name", "payment_last_name", "customer_first_name", "customer_last_name", "customer_email", "customer_phone", "pet_ids", "run_ids", "amenity_ids", "transID", "card_number", "completed", "checked_in", "checked_out", "three_weeks_before_email_reminder", "one_week_before_email_reminder", "day_before_email_reminder", "kennelID", "userID", "kennel_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31) RETURNING "id"
UPDATE "reservations" SET "reservationID" = $1, "updated_at" = $2 WHERE "reservations"."id" = $3  [["reservationID", 1], ["updated_at", "2019-06-17 10:47:18.724212"], ["id", 1]]

  def get_pets
  	@pets = []
  	@u = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "hello@gmail.com"]]