app/controllers/runs_controller.rb

  def create
    run = Run.new(run_params)
    user = User.where(id: current_user.id).first
    kennel = Kennel.where(user_id: user.id).last

    if run.valid? && kennel.runs.create(kennel_id: kennel.id, size_width: run.size_width, size_length: run.size_length, title: run.title, description: run.description, indoor_or_outdoor: run.indoor_or_outdoor, pets_per_run: run.pets_per_run, price: run.price.to_f, weight_limit: run.weight_limit, number_of_rooms: run.number_of_rooms, type_of_pets_allowed: run.type_of_pets_allowed )
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "kennels".* FROM "kennels" WHERE "kennels"."user_id" = $1  ORDER BY "kennels"."id" ASC LIMIT 1  [["user_id", 1]]
INSERT INTO "runs" ("kennel_id", "size_width", "size_length", "title", "description", "indoor_or_outdoor", "pets_per_run", "price", "number_of_rooms", "type_of_pets_allowed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"